syllabus/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-08-16 Sun 16:35 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>PPL &#x2013; Syllabus</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Zhitao Gong">
<meta name="description" content="COMP 3220 Principle of Programming Languages, Auburn University">
<meta name="keywords" content="comp3220, principle of programming languages, auburn university">
<link rel="stylesheet" href="/comp3220/css/normalize.css" type="text/css" />
<link rel="stylesheet" href="/comp3220/css/font-awesome.min.css" type="text/css" />
<link rel="stylesheet" href="https://gongzhitaao.github.io/orgcss/org.css" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">PPL &#x2013; Syllabus</h1>
</header><hr >

<div class="abstract">
<p>
Hopefull this is going to be a useful and fun course.
</p>

</div>

<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Textbook</a></li>
<li><a href="#orgheadline2">2. Homework</a></li>
<li><a href="#orgheadline3">3. Grading</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Textbook</h2>
<div class="outline-text-2" id="text-1">
<p>
You may need a textbook, <i>Concepts of Programming Languages (10th
Edition)</i> (get from <a href="http://www.amazon.com/Concepts-Programming-Languages-10th-Edition/dp/0131395319"><i class="fa fa-amazon"></i></a>), by Robert W. Sebesta.  My
slides are adapted from the textbook and slides from Dr. Carlisle.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Homework</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Homework is submitted on <a href="http://auburn.instructure.com/">Canvas</a></b>.  Late homework is penalized 40
points no matter how late it is.  The last day to turn in late
homework is the final exam.  The homework is accessible on the
<a href="http:/comp3220/">homepage</a>.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Grading</h2>
<div class="outline-text-2" id="text-3">
<p>
I have a TA do all the grading.  If you have any doubts, talk to the
TA first.  The tentitive weights for this semester are as follows.
</p>

<ul class="org-ul">
<li>Homework: 40%</li>
<li>Midterm: 20%</li>
<li>Final: 20%</li>
<li>Term Project: 20%</li>
</ul>

<hr >
</div>
</div>
</div>
<div id="postamble" class="status">
<a class="author"
       href="http://gongzhitaao.org">Zhitao Gong</a> / <span
       class="date">2015-08-16 Sun 16:35</span><span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3.1)</span>
</div>
</body>
</html>
